glocklueng/proditronicproject/prg/STM32/src/heating_controller/src/tempctrlpid_thr.c
			} // switch (indx)

		indx++;
		param= strtok(NULL, cmd_inter_strtok_del);
		}


	if (heater)
		{

		switch (cmd)
			{

			case 0x01:	// pwm
				{
				if (nparam == 1)
					{
					printf("<HTR> dev[%02d]: PWM set to %d\n", heater->indx, paramsval[0]);
					pwm_channel_set(heater->heater_ctrl_handler, paramsval[0]);
					}
				break;
				}

			case 0x02:	// temperatura zadana
				{
				if (nparam == 1)
					{
					printf("<HTR> dev[%02d]: temp set to %d\n", heater->indx, paramsval[0]);

					heater->temp_zadana= paramsval[0];

					heater->PID_data.uchyb_prev= 0x80000000; // magic value
					heater->PID_data.I_prev= 0;

					}
				break;
				}

			} // switch (cmd)


		} // if (heater)

	}

//-----------------------------------------------------------------------------

void cmdline_heater_pwm_duty_ratio_max_set(unsigned char *param)
	{
	k_ulong paramsval;

	if (!param)
		return;

	paramsval= atoi(param);

	if (paramsval < 0)
		paramsval= 0;
	else
	if (paramsval > 1000)
		paramsval= 1000;

	pwm_duty_ratio_max= paramsval;

	printf("<PWM> max duty ratio set to %d\n", pwm_duty_ratio_max);

	}

//-----------------------------------------------------------------------------

void cmdline_pid_set(unsigned char *param)
	{
	unsigned char *tokptr;
	k_uchar indx= 0;

	k_uchar cmd= 0xFF;
	k_uchar nparam= 0;

	const k_uchar max_nparam= 3;
	k_ulong paramsval[max_nparam];

	while (param)
		{

		switch (indx)
			{

			case 0:
				{

				if (!strcmp(param, "p"))
					cmd= 0x01;
				else
				if (!strcmp(param, "i"))
					cmd= 0x02;
				else
				if (!strcmp(param, "d"))
					cmd= 0x03;

				break;
				}

			default:
				{

				if (nparam < max_nparam)
					{
					paramsval[nparam]= atoi(param);
					nparam++;
					}

				break;
				}

			} // switch (indx)

		indx++;
		param= strtok(NULL, cmd_inter_strtok_del);
		}



	switch (cmd)
		{

		case 0x01:	// PID P
			{

			if (nparam == 1)
				{
				Kp= paramsval[0];
				printf("<PID> P set to: %d\n", Kp);
				}

			break;
			}

		case 0x02:	// PID I
			{

			if (nparam == 1)
				{
				Ki= paramsval[0];
				printf("<PID> I set to: %d\n", Ki);
				}

			break;
			}

		case 0x03:	// PID D
			{

			if (nparam == 1)
				{
				Kd= paramsval[0];
				printf("<PID> D set to: %d\n", Kd);
				}

			break;
			}

		} // switch (cmd)



	}


//-----------------------------------------------------------------------------

